
*** Train/Test Split of Data
Like other machine learning problems, recommender systems can be modeled as a supervised machine learning problem where the movie ratings of users are being utilized as features ot predict ratings for movie users have not watched yet. Viewing recommender systems in this way, we can split the data into training and testing sets to help validate the performance of our recommender system. The code below will split the Movielens dataset into a 75%, 25% train and test set:

#+begin_src python :results output
  import surprise
  from surprise import Dataset
  from surprise.model_selection import train_test_split

  movie_data = Dataset.load_builtin('ml-100k')

  trainset, testset = train_test_split(movie_data, test_size=.2, random_state=42)
#+end_src

#+RESULTS:

To understand what the data looks like, let's look at the ratings. To look at the ratings, we will use the ~ur~ method of ~trainset~. The method ~ur~ returns a dictionary where the keys are user ids, and the values are a list of tuples, where each tuple is in the form ~({item_id}, {rating})~. For example, to see the rating of user 590:

#+begin_src python :results output
  import surprise
  from surprise import Dataset
  from surprise.model_selection import train_test_split

  movie_data = Dataset.load_builtin('ml-100k')

  trainset, testset = train_test_split(movie_data, test_size=.2, random_state=42)

  print(trainset.ur[590])

#+end_src

#+RESULTS:
: [(699, 4.0), (114, 4.0), (339, 5.0), (769, 5.0), (230, 4.0), (212, 5.0), (21, 5.0), (33, 3.0), (94, 4.0), (74, 2.0), (22, 4.0), (471, 5.0), (8, 3.0), (305, 3.0), (645, 3.0), (558, 2.0), (166, 4.0), (129, 4.0), (100, 5.0), (232, 3.0), (391, 3.0), (204, 3.0), (508, 4.0), (79, 3.0), (83, 4.0), (426, 1.0), (6, 3.0), (58, 3.0), (1119, 5.0), (76, 5.0)]

*** Training a recommender system
Now that we have proper datasets for training and testing, we will now train a basic recommender system. Specifically, we will be training a simple user-user collaborative filter using Surprise's ~KNNBasic~ algorithm. KNNBasic is a very simple implementation of user-user /collaborative filtering./ This algorithm works by using the k-nearest neighbors (KNN) algorithm to determine the similarity of users based on how they rated movies. The average of the movie ratings from the most similar users are then used as the predicion for the target user. The recommender system is initialized and trained like so:

#+begin_src python :results output
  import surprise
  from surprise import Dataset
  from surprise.model_selection import train_test_split
  from surprise import KNNBasic

  movie_data = Dataset.load_builtin('ml-100k')

  trainset, testset = train_test_split(movie_data, test_size=.2, random_state=42)

  #print(trainset.ur[590])

  movie_recommender = KNNBasic()
  movie_recommender.fit(trainset)

#+end_src

#+RESULTS:
: Computing the msd similarity matrix...
: Done computing similarity matrix.

*** Evaluating Recommender System Performance
Finally, we will evaluate the performance of the ~KNNBasic~ recommender system. First, let's create some predictions on the test set.

#+begin_src python
  predicions = movie_recommender.test(testset)
#+end_src

The ~predictions~ are a list of ~Prediction~ objects. Each Prediction object contains a user id (~uid~), and item id representing the movie (~iid~), and actual rating given by the user for that movie (~r_ui~), an estimated rating from the recommender system (~est~) and some additional metadata about each prediction (~details~). An example of a ~Prediction~ object from our ~predictions~ can be seen below.

#+begin_src python :results output
  import surprise
  from surprise import Dataset
  from surprise.model_selection import train_test_split
  from surprise import KNNBasic

  movie_data = Dataset.load_builtin('ml-100k')

  trainset, testset = train_test_split(movie_data, test_size=.2, random_state=42)

  #print(trainset.ur[590])

  movie_recommender = KNNBasic()
  movie_recommender.fit(trainset)

  predictions = movie_recommender.test(testset)

  print(predictions[0])

#+end_src

#+RESULTS:
: Computing the msd similarity matrix...
: Done computing similarity matrix.
: user: 907        item: 143        r_ui = 5.00   est = 4.04   {'actual_k': 40, 'was_impossible': False}

This Prediction object contains a prediction for the movie 'The Sound of Music' (to see which movie each id corresponds to, take a look at this [[https://files.grouplens.org/datasets/movielens/ml-100k/u.item][movie data file]]). As seen above, the recommender system predicted a rating of about 4 stars, which is not very far from the actual prediction on 5 stars.

We can measure one aspect ot the model's performance by looking at the root-mean square error, or RMSE. The RMSE is an average measure of how far off predictions will be from their actual values. The closer the RMSE is to 0, the more accurate the model. The RMSE can also be thought of as a measure of *relevance*, or how likely the items recommended will be something the user would be interested in based on their previous behavior. It is important to note that while relevance is one important aspect of a recommender system, it is not the only important thing to optimize in a recommender system.

As seen below, Surprise makes it very easy to measure model RMSE.

#+begin_src python :results output
  import surprise
  from surprise import Dataset
  from surprise.model_selection import train_test_split
  from surprise import KNNBasic
  from surprise import accuracy

  movie_data = Dataset.load_builtin('ml-100k')

  trainset, testset = train_test_split(movie_data, test_size=.2, random_state=42)

  #print(trainset.ur[590])

  movie_recommender = KNNBasic()
  movie_recommender.fit(trainset)

  predictions = movie_recommender.test(testset)

  print(predictions[0])

  print(accuracy.rmse(predictions))

#+end_src

#+RESULTS:
: Computing the msd similarity matrix...
: Done computing similarity matrix.
: user: 907        item: 143        r_ui = 5.00   est = 4.04   {'actual_k': 40, 'was_impossible': False}
: RMSE: 0.9802
: 0.980150596704479

As seen above, the trained recommender system has an RMSE of about 0.98. We can now use this number as a bseline to see if there is a gain or loss in model performance versus other algorithms.

** Assessment
Now it's your turn! Using what you have learned, train a simple SVD recommender system using Surprise's ~SVD~ algorithm (documentation can be found [[https://surprise.readthedocs.io/en/stable/matrix_factorization.html#surprise.prediction_algorithms.matrix_factorization.SVD][here]]) and the provided training data. Then calculate its RMSE. Is this an improvement over the ~KNNBasic~ algorithm above? How can you tell?

#+begin_src python :results output
  import surprise
  from surprise import Dataset
  from surprise.model_selection import train_test_split
  from surprise import KNNBasic, SVD
  from surprise import accuracy

  movie_data = Dataset.load_builtin('ml-100k')

  trainset, testset = train_test_split(movie_data, test_size=.2, random_state=42)

  #print(trainset.ur[590])

  movie_recommender = KNNBasic()
  movie_recommender.fit(trainset)

  predictions = movie_recommender.test(testset)

  print(predictions[0])

  print(accuracy.rmse(predictions))

  svd_recommender = SVD()
  svd_recommender.fit(trainset)

  svd_predictions = svd_recommender.test(testset)

  accuracy.rmse(svd_predictions)

#+end_src

#+RESULTS:
: Computing the msd similarity matrix...
: Done computing similarity matrix.
: user: 907        item: 143        r_ui = 5.00   est = 4.04   {'actual_k': 40, 'was_impossible': False}
: RMSE: 0.9802
: 0.980150596704479
: RMSE: 0.9394
